In [1]:
import pandas as pd
from library.sb_utils import save_file

This dataset is found from https://www.kaggle.com/sudalairajkumar/daily-temperature-of-major-cities. It contains the daily average temperature of various major cities around the world from 1995 to 2020.

In order to perform time series analysis on this dataset, the dataset must first be cleaned.

In [2]:
df = pd.read_csv('../data/city_temperature.csv')

/Users/alex/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3165: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2906327 entries, 0 to 2906326
Data columns (total 8 columns):
 #   Column          Dtype
---  ------          -----
 0   Region          object
 1   Country         object
 2   State           object
 3   City            object
 4   Month           int64
 5   Day             int64
 6   Year            int64
 7   AvgTemperature  float64
dtypes: float64(1), int64(3), object(4)
memory usage: 177.4+ MB

In [4]:
df

,Region,Country,State,City,Month,Day,Year,AvgTemperature
0,Africa,Algeria,NaN,Algiers,1,1,1995,64.2
1,Africa,Algeria,NaN,Algiers,1,2,1995,49.4
2,Africa,Algeria,NaN,Algiers,1,3,1995,48.8
3,Africa,Algeria,NaN,Algiers,1,4,1995,46.4
4,Africa,Algeria,NaN,Algiers,1,5,1995,47.9
...,...,...,...,...,...,...,...,...
2906322,North America,US,Additional Territories,San Juan Puerto Rico,7,27,2013,82.4
2906323,North America,US,Additional Territories,San Juan Puerto Rico,7,28,2013,81.6
2906324,North America,US,Additional Territories,San Juan Puerto Rico,7,29,2013,84.2
2906325,North America,US,Additional Territories,San Juan Puerto Rico,7,30,2013,83.8
2906326,North America,US,Additional Territories,San Juan Puerto Rico,7,31,2013,83.6

We analyze each column to check for any null or incorrect/irregular values.

In [5]:
#Region
df.Region.isnull().values.any()

False

In [6]:
df.Region.value_counts()

North America                        1556681
Europe                                381990
Asia                                  316663
Africa                                251118
South/Central America & Carribean     219530
Middle East                           124749
Australia/South Pacific                55596
Name: Region, dtype: int64

In [7]:
#Country
df.Country.isnull().values.any()

False

In [8]:
df.Country.value_counts()

US                   1455337
Canada                 74245
Australia              46330
China                  46329
India                  37063
                      ...
Guyana                  5065
Israel                  4641
Burundi                 4543
Georgia                 4378
Serbia-Montenegro       3427
Name: Country, Length: 125, dtype: int64

In [9]:
#City
df.City.isnull().values.any()

False

In [10]:
df.City.value_counts()

Columbus         18530
Washington DC    18530
Springfield      18530
Washington       18530
Charleston       18530
                 ...
Frankfurt         4136
Flagstaff         3574
Pristina          3427
Yerevan           3226
Bonn              3133
Name: City, Length: 321, dtype: int64

In [11]:
#State
df.State.isnull().values.any()

True

Since we don't need the State column for our analysis, we can drop it from our dataset.

In [12]:
df = df.drop(columns=['State'])

In [13]:
#Check AvgTemperature column for null or incorrect entries
df.AvgTemperature.isnull().values.any()

False

In [14]:
df.AvgTemperature.value_counts()

-99.0    79672
 80.2     7442
 80.8     7362
 81.1     7247
 79.2     7241
         ...
-39.3        1
-46.9        1
-43.4        1
-35.4        1
-40.0        1
Name: AvgTemperature, Length: 1517, dtype: int64

-99 Degrees Fahrenheit is unrealistic, so we assume it's a placeholder for null values and remove all rows with it accordingly.

In [15]:
#Remove rows with average temperature of -99
df.drop(df.loc[df['AvgTemperature']==-99].index, inplace=True)
df.AvgTemperature.value_counts()

 80.2    7442
 80.8    7362
 81.1    7247
 79.2    7241
 80.5    7223
         ...
-39.3       1
-46.9       1
-43.4       1
-35.4       1
-33.9       1
Name: AvgTemperature, Length: 1516, dtype: int64

We can convert temperature from Fahrenheit to Celsius.

In [16]:
df.head()

   Region  Country     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria  Algiers      1    1  1995            64.2
1  Africa  Algeria  Algiers      1    2  1995            49.4
2  Africa  Algeria  Algiers      1    3  1995            48.8
3  Africa  Algeria  Algiers      1    4  1995            46.4
4  Africa  Algeria  Algiers      1    5  1995            47.9

In [17]:
df.AvgTemperature = round((df.AvgTemperature - 32)*5/9, 1)
df.head()

   Region  Country     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria  Algiers      1    1  1995            17.9
1  Africa  Algeria  Algiers      1    2  1995             9.7
2  Africa  Algeria  Algiers      1    3  1995             9.3
3  Africa  Algeria  Algiers      1    4  1995             8.0
4  Africa  Algeria  Algiers      1    5  1995             8.8